Вывод

```
a
undefined
```

//Пояснение:
//Сначала объявляются три функции `a`, `b` и `c`.
//Функции `a` и `b` являются стрелочными функциями без явного возвращаемого значения.
//В выражении `a || b` происходит проверка условия. Поскольку функция `a` определена, она будет считаться истинным значением, и выражение вернет `a`.
//Затем вызывается функция `a` с помощью `a()`, и в результате в консоль будет выведено "a".
//Однако функция `a` не возвращает никакого значения, поэтому значение `c` будет `undefined`.
//Затем в консоль будет выведено значение `c`, которое является `undefined`.

